Autodesk.Revit.DB.ExportDGNSettings.FindByName(Autodesk.Revit.DB.Document,System.String)
Returns the pre-defined non-in-session exporting settings for DGN in the given document with the specified name.
aDoc:
A Revit document to retrieve the specified pre-defined exporting settings for DGN.
name:
The name of the settings to retrieve.
Returns:
The pre-defined DGN exporting settings, or null if nothing found that has the corresponding name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExportDGNSettings.GetActivePredefinedSettings(Autodesk.Revit.DB.Document)
Returns the active pre-defined non-in-session exporting settings for DGN in the given document.
aDoc:
A Revit document to retrieve the active pre-defined exporting settings for DGN.
Returns:
The active pre-defined exporting settings for DGN, or null if nothing pre-defined exists or the in-session settings is selected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.ExportDGNSettings.ListNames(Autodesk.Revit.DB.Document)
Returns a list of names of dgn export settings.
aDoc:
A Revit document to retrieve names from
Returns:
An array of strings representing names of predefined setups.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDGNSettings.SetDGNExportOptions(Autodesk.Revit.DB.DGNExportOptions)
Sets the options stored in these settings.
options:
The options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDGNSettings.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.DGNExportOptions)
Create DGN export settings with specified values in DGNExportOptions.
document:
Document where created settings is saved.
name:
The name specified to this settings.
options:
The options which will be stored in these settings.
Returns:
The new DGN export settings instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ExistOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ExportDGNSettings.Create(Autodesk.Revit.DB.Document,System.String)
Create a DGN export settings with default values.
document:
Document where created settings is saved.
name:
The name specified to this settings.
Returns:
The new DGN export settings instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ExistOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013